//*****************************************************************************
// SceneClear.cpp
// ゲームクリアのシーン
//*****************************************************************************
#include "SceneClear.h"
#include "Sound.h"
#include "InputManager.h"

//*****************************************************************************
// コンストラクタ関数
//*****************************************************************************
SceneClear::SceneClear()
{
	Clear = new C_Ui("data/texture/clear.jpg", UI_CLEAR);
	Score = new C_Ui("data/texture/number.png", UI_RESULT_SCORE); 
	PlaySoundGame(SOUND_LABEL_BGM_CLEAR);
}


SceneClear::~SceneClear()
{
	StopSound();
	Uninit();
}

//*****************************************************************************
//Init関数
//初期化関数
//引数：void
//戻：void
//*****************************************************************************
void SceneClear::Init()
{
	//なし
}

//*****************************************************************************
//Uninit関数
//終了関数
//引数：void
//戻：void
//*****************************************************************************
void SceneClear::Uninit()
{
	SAFE_DELETE(Clear);
}

//*****************************************************************************
//Update関数
//変更関数
//引数：void
//戻：void
//*****************************************************************************
int SceneClear::Update()
{
	Clear->Update();

	if (GetInput(INPUT_JUMP)) {
		return SCENE_RANKING;
	}

	return SCENE_CLEAR;
}

//*****************************************************************************
//Draw関数
//レンダリング関数
//引数：void
//戻：void
//*****************************************************************************
void SceneClear::Draw()
{
	SetZBuffer(false);
	Clear->Draw();

	Score->Draw();
}
